<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"ee631277ea30ad1accf80b9205dda1f8be08fc929e01be7d689f6d94b4b6f075","plan_job_ref":"Job Staging Image Build & Push #62 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7518990360","plan_out_hash":"ca1bf59843d600f6f352bd7a1a11c26e526deda32298ada275259d3baa2b3341","plan_hash":"2ed414f7dc9e14aa1cd3f8f47abfdb9bb88f6ce78d2738b664bf684368e21462","plan_text_format":"diff","version":"1.41.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.ASG_config will be updated in-place
!~  resource "aws_autoscaling_group" "ASG_config" {
!~      desired_capacity                 = 1 -> 0
+       desired_capacity_type            = "units"
        id                               = "fastapi-ASG-dev"
!~      min_size                         = 1 -> 0
        name                             = "fastapi-ASG-dev"
#        (24 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:49" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:49" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:25dd427b6600694128e5505e8bbf6e029a7b0978" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:1de6069275b36346528113ca0b5d0fad8a9dfcae"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
+       network_mode             = (known after apply)
!~      revision                 = 49 -> (known after apply)
-       tags                     = {} -> null
#        (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #62](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7518990360)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>